{
    "Title": "Draconic Musings",
    "Credits": "Created by Victoria Morgan (raenglan@ucsc.edu).",
    "InitialLocation": "Hoard",
    "Locations": {
        "Hoard": {
            "Body": "Every dragon needs a horde, and this is yours.",
            "Choices": [
                {
                    "Text": "Towards the light",
                    "Target": "Hallway"
                },
                {
                    "Text": "Deeper in",
                    "Target": "Deep"
                }
            ]
        },
        "Deep": {
            "Body": "Deeper into the cavern lies all of the more... delicate items in your hoard. Not everything is worth lying upon.",
            "Choices": [
                {
                    "Text": "Back up",
                    "Target": "Hoard"
                }
            ]
        },
        "Hallway": {
            "Body": "Your lair is at first glance merely a simple cave, with several pockets of rock leading off of it. You know better.",
            "Choices": [
                {
                    "Text": "Towards the allure of gold",
                    "Target": "Hoard"
                },
                {
                    "Text": "Towards the allure of gemstones",
                    "Target": "Freezer"
                },
                {
                    "Text": "Towards the allure of vanity",
                    "Target": "Mirror"
                },
                {
                    "Text": "Towards the allure of freedom",
                    "Target": "Entrance"
                }
            ]
        },
        "Freezer": {
            "Body": "A large gemstone the size of a basketball court lies embedded in the floor. It radiates cold, and lying upon it is a choice selection of items in case you get... peckish.",
            "Choices": [
                {
                    "Text": "Enough of that",
                    "Target": "Hallway"
                }
            ]
        },
        "Mirror": {
            "Body": "A large mirror leans against the wall, perfect and golden. You could swim in its depths. But you won't. Never again.",
            "Choices": [
                {
                    "Text": "Pry your eyes away from the silver glass",
                    "Target": "Hallway"
                }
            ]
        },
        "Entrance": {
            "Body": "The entrance to your lair looks out upon the treetops. A world spreads itself before your watchful gaze, full of possibilities.",
            "Choices": [
                {
                    "Text": "Stick around",
                    "Target": "Hallway"
                },
                {
                    "Text": "Rule the skies",
                    "Target": "Sky"
                }
            ]
        },
        "Sky": {
            "Body": "The endless skies call to you, full of fluffy clouds and birds who know better than to fly in your way. Below you are fields full of golden wheat and plains full of raw filet mignon. You can hear the moos as they chew the grass and what wheat they can reach.",
            "Choices": [
                {
                    "Text": "Enough flying",
                    "Target": "Entrance"
                },
                {
                    "Text": "Add to your hoard",
                    "Target": "Beyond"
                }
            ]
        },
        "Beyond": {
            "Body": "Angling your body to catch the flowing wind, you fly towards a nearby kingdom. They usually have tidbits to add to your hoard, and royalty with which to cook filet mignon. Princesses, usually. It always comes down to princesses, doesn't it?"
        }
    }
}